# frozen_string_literal: true

require 'os'

brew 'antidote'
brew 'autoconf'
brew 'bat'
brew 'binutils'
brew 'btop'
brew 'carapace'
brew 'coreutils'
brew 'curl'
brew 'delta'
brew 'eza'
brew 'fd'
brew 'flex'
brew 'fop'
brew 'fzf'
brew 'gh'
brew 'git-delta'
brew 'git-flow'
brew 'gollama'
brew 'graphviz'
brew 'grep'
brew 'grpc'
brew 'gzip'
brew 'ijq'
brew 'imagemagick'
brew 'less'
brew 'libpq'
brew 'libxslt'
brew 'libyaml'
brew 'make'
brew 'mise'
brew 'neovim'
brew 'nmap'
brew 'ollama'
brew 'postgresql@17'
brew 'pgcli'
brew 'pkgconfig'
brew 'redis'
brew 'rsync'
brew 'rust'
brew 'screen'
brew 'shellcheck'
brew 'starship'
brew 'tmux'
brew 'shared-mime-info'
brew 'unixodbc'
brew 'watch'
brew 'wdiff'
brew 'wget'
brew 'wxwidgets'
brew 'zsh'

if OS.mac?
  brew 'diffutils'
  brew 'findutils'
  brew 'gawk'
  brew 'git'
  brew 'gnu-indent'
  brew 'gnu-sed'
  brew 'gnu-tar'
  brew 'gnu-which'
  brew 'gpatch'
  brew 'zip'
end
